# LAB 04 - Data preprocessing

## 02 행 기준 병합

### #01.준비작업
- 라이브러리 참조 및 데이터 불러오기

In [20]:
from hossam import load_data

In [21]:
origin=load_data('grade')
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02.데이터 정렬 : 변수에 의한 정렬
- 기본값이 오름차순이기 때문에, 내림 차순은 ascending=False

In [22]:
단일정렬df = origin.sort_values('학년',ascending=False)
단일정렬df

    학년  성별  국어   영어  수학  과학
이름
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
수현   3  여자  63   60  31  71
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
철수   1  남자  98   77  88  64
민철   1  남자  92   70  83  79
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02.데이터 정렬 : 여러 변수 정렬
- 학년이 같은 경우 국어성적으로 정렬

In [23]:

복수정렬df = origin.sort_values(['학년','국어'],
                            ascending=[False,False])

복수정렬df

    학년  성별  국어   영어  수학  과학
이름
영호   4  남자  80   88  91  72
호영   4  남자  75   50  90  88
수현   3  여자  63   60  31  71
영희   2  여자  88  120  62  72
용식   2  남자  82   88  79  90
철수   1  남자  98   77  88  64
민철   1  남자  92   70  83  79
석영   1  남자  91   90  89  80
나영   1  여자  90   92  81  95

### #02.데이터 정렬 : 인덱스를 기준으로 정렬
- 인덱스는 하나만 존재하므로 어떤 열로 정렬할 건지는 입력이 불필요

In [24]:
인덱스정렬df =  origin.sort_index(ascending=False)
인덱스정렬df

    학년  성별  국어   영어  수학  과학
이름
호영   4  남자  75   50  90  88
철수   1  남자  98   77  88  64
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
영호   4  남자  80   88  91  72
수현   3  여자  63   60  31  71
석영   1  남자  91   90  89  80
민철   1  남자  92   70  83  79
나영   1  여자  90   92  81  95

### #03.필터링 : 행 단위 필터링 (조건 검색)

In [25]:
#r1 = origin[origin['국어']>80] >> 동일 표현
r1 = origin.query('국어>80')  #조건을 " " 안에 넣어야한다
r1

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [26]:
#r1 = origin[origin['성별'] =='남자'] >> 동일 표현
r2 = origin.query("성별 == '남자'")  #조건을 " " 안에 넣어야하고, str 값은 또 다른 따옴표로 감싸줘야한다
r2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
호영   4  남자  75  50  90  88
영호   4  남자  80  88  91  72
용식   2  남자  82  88  79  90
석영   1  남자  91  90  89  80

In [27]:
r3=origin.query('국어 > 80 and 수학 > 80')
r3

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

In [28]:
r4=origin.query('국어 <= 80 or 수학 <=80')
r4

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90

In [29]:
#조건값을 변수로 적용하기 > @변수이름 형태로 조건식에 포함된다

point = int(input('점수를 입력하세요:'))

print('국어 점수가 %d 점 보다 높은 학생'%point)


r5=origin.query('국어 > @point')
r5

국어 점수가 80 점 보다 높은 학생

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [30]:
#열 단위의 필터링
fl = origin.filter(['국어','영어'])
fl

    국어   영어
이름
철수  98   77
영희  88  120
민철  92   70
수현  63   60
호영  75   50
영호  80   88
용식  82   88
나영  90   92
석영  91   90